In [2]:
import pandas as pd
import numpy as np

In [3]:
# create serise
df = pd.Series(np.arange(11,20))
df

0    11
1    12
2    13
3    14
4    15
5    16
6    17
7    18
8    19
dtype: int64

In [4]:
# create data frame 
df = pd.DataFrame({
    "Name":["Bhavin","Anand","Sagar","Hemal","Sagil","Abhay","Dhaval"],
    "Age":[45,65,34,65,76,65,34]
})
df

     Name  Age
0  Bhavin   45
1   Anand   65
2   Sagar   34
3   Hemal   65
4   Sagil   76
5   Abhay   65
6  Dhaval   34

In [5]:
# Creating a DataFrame by passing a NumPy array with a datetime index using date_range() and labeled columns:

# date_range function 
dates = pd.date_range("20250101",periods=6)
dates

DatetimeIndex(['2025-01-01', '2025-01-02', '2025-01-03', '2025-01-04',
               '2025-01-05', '2025-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=list("abcd"))
df.a

2025-01-01   -0.828945
2025-01-02    0.846814
2025-01-03   -0.532373
2025-01-04    0.737850
2025-01-05    1.890129
2025-01-06    0.303328
Freq: D, Name: a, dtype: float64

In [7]:
# check type's of dataframe
df.dtypes

a    float64
b    float64
c    float64
d    float64
dtype: object

In [8]:
df = pd.DataFrame({
    "Name":["Bhavin","Anand","Sagar","Hemal","Sagil","Abhay","Dhaval"],
    "Age":[45,65,34,65,76,65,34],
    "Salary":[np.random.randint(10000,50000) for i in range(7)],
    "Bonus":[np.random.randint(5000,10000) for i in range(7)],
})
df["Total"] = df["Salary"] + df["Bonus"]
df

     Name  Age  Salary  Bonus  Total
0  Bhavin   45   33740   8032  41772
1   Anand   65   29182   8037  37219
2   Sagar   34   15372   9032  24404
3   Hemal   65   45994   5813  51807
4   Sagil   76   43103   8619  51722
5   Abhay   65   25503   5275  30778
6  Dhaval   34   34453   6268  40721

In [9]:
# Use DataFrame.head() and DataFrame.tail() to view the top and bottom rows of the frame respectively

df.head() # it pass value or by default return row's

     Name  Age  Salary  Bonus  Total
0  Bhavin   45   33740   8032  41772
1   Anand   65   29182   8037  37219
2   Sagar   34   15372   9032  24404
3   Hemal   65   45994   5813  51807
4   Sagil   76   43103   8619  51722

In [10]:
df.tail() # it same like head but it is return buttom row's

     Name  Age  Salary  Bonus  Total
2   Sagar   34   15372   9032  24404
3   Hemal   65   45994   5813  51807
4   Sagil   76   43103   8619  51722
5   Abhay   65   25503   5275  30778
6  Dhaval   34   34453   6268  40721

In [11]:
print(df.index) # index is return to index of dataframe 
df.columns # column is return to column of data frame

RangeIndex(start=0, stop=7, step=1)

Index(['Name', 'Age', 'Salary', 'Bonus', 'Total'], dtype='object')

In [12]:
# Return a NumPy representation of the underlying data with DataFrame.to_numpy() without the index or column labels:
df.to_numpy()

array([['Bhavin', 45, 33740, 8032, 41772],
       ['Anand', 65, 29182, 8037, 37219],
       ['Sagar', 34, 15372, 9032, 24404],
       ['Hemal', 65, 45994, 5813, 51807],
       ['Sagil', 76, 43103, 8619, 51722],
       ['Abhay', 65, 25503, 5275, 30778],
       ['Dhaval', 34, 34453, 6268, 40721]], dtype=object)

In [13]:
# describe() shows a quick statistic summary of your data:
df.describe()

             Age        Salary        Bonus         Total
count   7.000000      7.000000     7.000000      7.000000
mean   54.857143  32478.142857  7296.571429  39774.714286
std    16.945290  10433.884119  1482.976383  10133.521463
min    34.000000  15372.000000  5275.000000  24404.000000
25%    39.500000  27342.500000  6040.500000  33998.500000
50%    65.000000  33740.000000  8032.000000  40721.000000
75%    65.000000  38778.000000  8328.000000  46747.000000
max    76.000000  45994.000000  9032.000000  51807.000000

In [14]:
# ransposing your data:
df.T

             0      1      2      3      4      5       6
Name    Bhavin  Anand  Sagar  Hemal  Sagil  Abhay  Dhaval
Age         45     65     34     65     76     65      34
Salary   33740  29182  15372  45994  43103  25503   34453
Bonus     8032   8037   9032   5813   8619   5275    6268
Total    41772  37219  24404  51807  51722  30778   40721

In [15]:
# DataFrame.sort_index() sorts by an axis:
df.sort_index(axis=1,ascending=True)

   Age  Bonus    Name  Salary  Total
0   45   8032  Bhavin   33740  41772
1   65   8037   Anand   29182  37219
2   34   9032   Sagar   15372  24404
3   65   5813   Hemal   45994  51807
4   76   8619   Sagil   43103  51722
5   65   5275   Abhay   25503  30778
6   34   6268  Dhaval   34453  40721

In [16]:
# DataFrame.sort_values() sorts by values:
df.sort_values(by="Name")

     Name  Age  Salary  Bonus  Total
5   Abhay   65   25503   5275  30778
1   Anand   65   29182   8037  37219
0  Bhavin   45   33740   8032  41772
6  Dhaval   34   34453   6268  40721
3   Hemal   65   45994   5813  51807
2   Sagar   34   15372   9032  24404
4   Sagil   76   43103   8619  51722

In [17]:
df["Name"] # select column

0    Bhavin
1     Anand
2     Sagar
3     Hemal
4     Sagil
5     Abhay
6    Dhaval
Name: Name, dtype: object

In [18]:
df[1:3] # slicing

    Name  Age  Salary  Bonus  Total
1  Anand   65   29182   8037  37219
2  Sagar   34   15372   9032  24404

In [19]:
df[df["Age"] > 45] # use boolean condition

    Name  Age  Salary  Bonus  Total
1  Anand   65   29182   8037  37219
3  Hemal   65   45994   5813  51807
4  Sagil   76   43103   8619  51722
5  Abhay   65   25503   5275  30778

In [20]:
df[["Age","Name"]] # select mutiple column

   Age    Name
0   45  Bhavin
1   65   Anand
2   34   Sagar
3   65   Hemal
4   76   Sagil
5   65   Abhay
6   34  Dhaval

- Selection by label

In [21]:
# selecting by lable
df.loc[0]

Name      Bhavin
Age           45
Salary     33740
Bonus       8032
Total      41772
Name: 0, dtype: object

In [22]:
# selecting all rows (:) with a select column labels:
df.loc[:,["Name","Age"]]

     Name  Age
0  Bhavin   45
1   Anand   65
2   Sagar   34
3   Hemal   65
4   Sagil   76
5   Abhay   65
6  Dhaval   34

In [23]:
df.loc[1:3,["Name","Salary"]]

    Name  Salary
1  Anand   29182
2  Sagar   15372
3  Hemal   45994

- Selection by position

In [24]:
df.iloc[1]

Name      Anand
Age          65
Salary    29182
Bonus      8037
Total     37219
Name: 1, dtype: object

In [25]:
df.iloc[1:3,0:4]

    Name  Age  Salary  Bonus
1  Anand   65   29182   8037
2  Sagar   34   15372   9032

In [26]:
df.iloc[[1,5,3],[0,2]] # select to row and column and useing list pass

    Name  Salary
1  Anand   29182
5  Abhay   25503
3  Hemal   45994

In [27]:
df.iloc[1:4,:]

    Name  Age  Salary  Bonus  Total
1  Anand   65   29182   8037  37219
2  Sagar   34   15372   9032  24404
3  Hemal   65   45994   5813  51807

In [28]:
df.iloc[:,1:3]

   Age  Salary
0   45   33740
1   65   29182
2   34   15372
3   65   45994
4   76   43103
5   65   25503
6   34   34453

In [29]:
df.iat[1,1]

np.int64(65)

In [30]:
df2 = df.copy()
df2

     Name  Age  Salary  Bonus  Total
0  Bhavin   45   33740   8032  41772
1   Anand   65   29182   8037  37219
2   Sagar   34   15372   9032  24404
3   Hemal   65   45994   5813  51807
4   Sagil   76   43103   8619  51722
5   Abhay   65   25503   5275  30778
6  Dhaval   34   34453   6268  40721

In [31]:
# isin method
df2["Name"].isin(["Bhavin","Anand"]) # return true or false

0     True
1     True
2    False
3    False
4    False
5    False
6    False
Name: Name, dtype: bool

In [32]:
#where contdition
df = df.where(df["Age"] > 40)
df

     Name   Age   Salary   Bonus    Total
0  Bhavin  45.0  33740.0  8032.0  41772.0
1   Anand  65.0  29182.0  8037.0  37219.0
2     NaN   NaN      NaN     NaN      NaN
3   Hemal  65.0  45994.0  5813.0  51807.0
4   Sagil  76.0  43103.0  8619.0  51722.0
5   Abhay  65.0  25503.0  5275.0  30778.0
6     NaN   NaN      NaN     NaN      NaN

In [33]:
# DataFrame.dropna() drops any rows that have missing data
df.dropna(how='any')

     Name   Age   Salary   Bonus    Total
0  Bhavin  45.0  33740.0  8032.0  41772.0
1   Anand  65.0  29182.0  8037.0  37219.0
3   Hemal  65.0  45994.0  5813.0  51807.0
4   Sagil  76.0  43103.0  8619.0  51722.0
5   Abhay  65.0  25503.0  5275.0  30778.0

In [34]:
# DataFrame.fillna() fills missing data:
df.fillna(value=5)

     Name   Age   Salary   Bonus    Total
0  Bhavin  45.0  33740.0  8032.0  41772.0
1   Anand  65.0  29182.0  8037.0  37219.0
2       5   5.0      5.0     5.0      5.0
3   Hemal  65.0  45994.0  5813.0  51807.0
4   Sagil  76.0  43103.0  8619.0  51722.0
5   Abhay  65.0  25503.0  5275.0  30778.0
6       5   5.0      5.0     5.0      5.0

In [35]:
# isna() gets the boolean mask where values are nan
df.isna()

    Name    Age  Salary  Bonus  Total
0  False  False   False  False  False
1  False  False   False  False  False
2   True   True    True   True   True
3  False  False   False  False  False
4  False  False   False  False  False
5  False  False   False  False  False
6   True   True    True   True   True

In [36]:
df.dropna(inplace=True)
df

     Name   Age   Salary   Bonus    Total
0  Bhavin  45.0  33740.0  8032.0  41772.0
1   Anand  65.0  29182.0  8037.0  37219.0
3   Hemal  65.0  45994.0  5813.0  51807.0
4   Sagil  76.0  43103.0  8619.0  51722.0
5   Abhay  65.0  25503.0  5275.0  30778.0

In [37]:
print(df["Age"].mean())
print(df["Age"].min())
print(df["Age"].max())
print(df["Age"].max())

63.2
45.0
76.0
76.0

In [38]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2025-01-01    NaN
2025-01-02    NaN
2025-01-03    1.0
2025-01-04    3.0
2025-01-05    5.0
2025-01-06    NaN
Freq: D, dtype: float64

In [39]:
# user define function
# DataFrame.agg() and DataFrame.transform() applies a user defined function that reduces or broadcasts its result respectively.
print(df["Age"].agg(lambda x: np.mean(x) * 5.6))
print(df["Salary"].transform(lambda x:x * 5))

0    252.0
1    364.0
3    364.0
4    425.6
5    364.0
Name: Age, dtype: float64
0    168700.0
1    145910.0
3    229970.0
4    215515.0
5    127515.0
Name: Salary, dtype: float64

C:\Users\Lenovo\AppData\Local\Temp\ipykernel_4812\2500158097.py:3: FutureWarning: using <function <lambda> at 0x0000018D55D163E0> in Series.agg cannot aggregate and has been deprecated. Use Series.transform to keep behavior unchanged.
  print(df["Age"].agg(lambda x: np.mean(x) * 5.6))

In [40]:
s = pd.Series(np.random.randint(100,200,size=10))
s

0    148
1    136
2    149
3    140
4    104
5    114
6    147
7    181
8    182
9    156
dtype: int32

In [41]:
s.value_counts() # value cound to repited value is how many type repite

148    1
136    1
149    1
140    1
104    1
114    1
147    1
181    1
182    1
156    1
Name: count, dtype: int64

In [42]:
df1 = pd.DataFrame({
    "Name":["Bhavin","Bhai","Hariyani"]
})


df2 = pd.DataFrame({
    "City":["amreli","savarkundala","surat"]
})

c = np.concat([df1,df2],axis=1)
c

array([['Bhavin', 'amreli'],
       ['Bhai', 'savarkundala'],
       ['Hariyani', 'surat']], dtype=object)

In [43]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

# merge

pd.merge(left,right,on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [44]:
df.groupby("Salary").sum()
df.groupby("Salary")["Name"].sum()

Salary
25503.0     Abhay
29182.0     Anand
33740.0    Bhavin
43103.0     Sagil
45994.0     Hemal
Name: Name, dtype: object

In [45]:
df = pd.DataFrame({
    "Name":["A","B","C","D","A","B"],
    "Salary":[np.random.randint(100,200) for i in range(6)]
})
df.groupby("Name")["Salary"].sum()

Name
A    288
B    230
C    117
D    172
Name: Salary, dtype: int64

In [46]:
# The stack() method compresses a level in the DataFrames columns:
df.stack()

0  Name        A
   Salary    181
1  Name        B
   Salary    125
2  Name        C
   Salary    117
3  Name        D
   Salary    172
4  Name        A
   Salary    107
5  Name        B
   Salary    105
dtype: object

In [47]:
df.unstack()

Name    0      A
        1      B
        2      C
        3      D
        4      A
        5      B
Salary  0    181
        1    125
        2    117
        3    172
        4    107
        5    105
dtype: object

In [48]:
df.unstack(0)

Name    0      A
        1      B
        2      C
        3      D
        4      A
        5      B
Salary  0    181
        1    125
        2    117
        3    172
        4    107
        5    105
dtype: object

In [49]:
df_sales = pd.DataFrame({
    "OrderID": [101, 102, 103, 104, 105, 106, 107],
    "Customer": ["Ramesh", "Suresh", "Anita", "Kiran", "Pooja", "Ramesh", "Anita"],
    "Product": ["Laptop", "Mobile", "Headphones", "Keyboard", "Monitor", "Mobile", "Laptop"],
    "Quantity": [1, 2, 3, 2, 1, 1, 2],
    "Price": [45000, 15000, 2000, 1200, 8000, 15000, 45000]
})
df_sales["Total"] = df_sales["Quantity"] * df_sales["Price"]
df_sales

pivot1 = pd.pivot_table(df_sales, 
                        index="Customer", 
                        values="Total", 
                        aggfunc="sum")
pivot1

          Total
Customer
Anita     96000
Kiran      2400
Pooja      8000
Ramesh    60000
Suresh    30000